apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_lpspi.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_lpspi.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_LPSPI_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_LPSPI_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* LPSPI Register Offsets ***************************************************/

#define S32K3XX_LPSPI_VERID_OFFSET     (0x0000) /* Version ID Register (VERID) */
#define S32K3XX_LPSPI_PARAM_OFFSET     (0x0004) /* Parameter Register (PARAM) */
#define S32K3XX_LPSPI_CR_OFFSET        (0x0010) /* Control Register (CR) */
#define S32K3XX_LPSPI_SR_OFFSET        (0x0014) /* Status Register (SR) */
#define S32K3XX_LPSPI_IER_OFFSET       (0x0018) /* Interrupt Enable Register (IER) */
#define S32K3XX_LPSPI_DER_OFFSET       (0x001c) /* DMA Enable Register (DER) */
#define S32K3XX_LPSPI_CFGR0_OFFSET     (0x0020) /* Configuration Register 0 (CFGR0) */
#define S32K3XX_LPSPI_CFGR1_OFFSET     (0x0024) /* Configuration Register 1 (CFGR1) */
#define S32K3XX_LPSPI_DMR0_OFFSET      (0x0030) /* Data Match Register 0 (DMR0) */
#define S32K3XX_LPSPI_DMR1_OFFSET      (0x0034) /* Data Match Register 1 (DMR1) */
#define S32K3XX_LPSPI_CCR_OFFSET       (0x0040) /* Clock Configuration Register (CCR) */
#define S32K3XX_LPSPI_CCR1_OFFSET      (0x0044) /* Clock Configuration Register 1 (CCR1) */
#define S32K3XX_LPSPI_FCR_OFFSET       (0x0058) /* FIFO Control Register (FCR) */
#define S32K3XX_LPSPI_FSR_OFFSET       (0x005c) /* FIFO Status Register (FSR) */
#define S32K3XX_LPSPI_TCR_OFFSET       (0x0060) /* Transmit Command Register (TCR) */
#define S32K3XX_LPSPI_TDR_OFFSET       (0x0064) /* Transmit Data Register (TDR) */
#define S32K3XX_LPSPI_RSR_OFFSET       (0x0070) /* Receive Status Register (RSR) */
#define S32K3XX_LPSPI_RDR_OFFSET       (0x0074) /* Receive Data Register (RDR) */
#define S32K3XX_LPSPI_RDROR_OFFSET     (0x0078) /* Receive Data Read Only Register (RDROR) */
#define S32K3XX_LPSPI_TCBR_OFFSET      (0x03fc) /* Transmit Command Burst Register (TCBR) */

#define S32K3XX_LPSPI_TDBR_OFFSET(n)   (0x0400 + ((n) << 2)) /* Transmit Data Burst Register n=0..127 (TDBRn) */
#define S32K3XX_LPSPI_RDBR_OFFSET(n)   (0x0600 + ((n) << 2)) /* Receive Data Burst Register n=0..127 (RDBRn) */

/* LPSPI Register Addresses *************************************************/

#define S32K3XX_LPSPI0_VERID           (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_VERID_OFFSET)
#define S32K3XX_LPSPI0_PARAM           (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_PARAM_OFFSET)
#define S32K3XX_LPSPI0_CR              (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_CR_OFFSET)
#define S32K3XX_LPSPI0_SR              (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_SR_OFFSET)
#define S32K3XX_LPSPI0_IER             (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_IER_OFFSET)
#define S32K3XX_LPSPI0_DER             (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_DER_OFFSET)
#define S32K3XX_LPSPI0_CFGR0           (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_CFGR0_OFFSET)
#define S32K3XX_LPSPI0_CFGR1           (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_CFGR1_OFFSET)
#define S32K3XX_LPSPI0_DMR0            (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_DMR0_OFFSET)
#define S32K3XX_LPSPI0_DMR1            (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_DMR1_OFFSET)
#define S32K3XX_LPSPI0_CCR             (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_CCR_OFFSET)
#define S32K3XX_LPSPI0_CCR1            (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_CCR1_OFFSET)
#define S32K3XX_LPSPI0_FCR             (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_FCR_OFFSET)
#define S32K3XX_LPSPI0_FSR             (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_FSR_OFFSET)
#define S32K3XX_LPSPI0_TCR             (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_TCR_OFFSET)
#define S32K3XX_LPSPI0_TDR             (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_TDR_OFFSET)
#define S32K3XX_LPSPI0_RSR             (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_RSR_OFFSET)
#define S32K3XX_LPSPI0_RDR             (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_RDR_OFFSET)
#define S32K3XX_LPSPI0_RDROR           (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_RDROR_OFFSET)
#define S32K3XX_LPSPI0_TCBR            (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_TCBR_OFFSET)
#define S32K3XX_LPSPI0_TDBR(n)         (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_TDBR_OFFSET(n))
#define S32K3XX_LPSPI0_RDBR(n)         (S32K3XX_LPSPI0_BASE + S32K3XX_LPSPI_RDBR_OFFSET(n))

#define S32K3XX_LPSPI1_VERID           (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_VERID_OFFSET)
#define S32K3XX_LPSPI1_PARAM           (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_PARAM_OFFSET)
#define S32K3XX_LPSPI1_CR              (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_CR_OFFSET)
#define S32K3XX_LPSPI1_SR              (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_SR_OFFSET)
#define S32K3XX_LPSPI1_IER             (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_IER_OFFSET)
#define S32K3XX_LPSPI1_DER             (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_DER_OFFSET)
#define S32K3XX_LPSPI1_CFGR0           (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_CFGR0_OFFSET)
#define S32K3XX_LPSPI1_CFGR1           (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_CFGR1_OFFSET)
#define S32K3XX_LPSPI1_DMR0            (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_DMR0_OFFSET)
#define S32K3XX_LPSPI1_DMR1            (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_DMR1_OFFSET)
#define S32K3XX_LPSPI1_CCR             (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_CCR_OFFSET)
#define S32K3XX_LPSPI1_CCR1            (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_CCR1_OFFSET)
#define S32K3XX_LPSPI1_FCR             (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_FCR_OFFSET)
#define S32K3XX_LPSPI1_FSR             (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_FSR_OFFSET)
#define S32K3XX_LPSPI1_TCR             (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_TCR_OFFSET)
#define S32K3XX_LPSPI1_TDR             (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_TDR_OFFSET)
#define S32K3XX_LPSPI1_RSR             (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_RSR_OFFSET)
#define S32K3XX_LPSPI1_RDR             (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_RDR_OFFSET)
#define S32K3XX_LPSPI1_RDROR           (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_RDROR_OFFSET)
#define S32K3XX_LPSPI1_TCBR            (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_TCBR_OFFSET)
#define S32K3XX_LPSPI1_TDBR(n)         (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_TDBR_OFFSET(n))
#define S32K3XX_LPSPI1_RDBR(n)         (S32K3XX_LPSPI1_BASE + S32K3XX_LPSPI_RDBR_OFFSET(n))

#define S32K3XX_LPSPI2_VERID           (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_VERID_OFFSET)
#define S32K3XX_LPSPI2_PARAM           (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_PARAM_OFFSET)
#define S32K3XX_LPSPI2_CR              (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_CR_OFFSET)
#define S32K3XX_LPSPI2_SR              (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_SR_OFFSET)
#define S32K3XX_LPSPI2_IER             (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_IER_OFFSET)
#define S32K3XX_LPSPI2_DER             (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_DER_OFFSET)
#define S32K3XX_LPSPI2_CFGR0           (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_CFGR0_OFFSET)
#define S32K3XX_LPSPI2_CFGR1           (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_CFGR1_OFFSET)
#define S32K3XX_LPSPI2_DMR0            (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_DMR0_OFFSET)
#define S32K3XX_LPSPI2_DMR1            (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_DMR1_OFFSET)
#define S32K3XX_LPSPI2_CCR             (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_CCR_OFFSET)
#define S32K3XX_LPSPI2_CCR1            (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_CCR1_OFFSET)
#define S32K3XX_LPSPI2_FCR             (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_FCR_OFFSET)
#define S32K3XX_LPSPI2_FSR             (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_FSR_OFFSET)
#define S32K3XX_LPSPI2_TCR             (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_TCR_OFFSET)
#define S32K3XX_LPSPI2_TDR             (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_TDR_OFFSET)
#define S32K3XX_LPSPI2_RSR             (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_RSR_OFFSET)
#define S32K3XX_LPSPI2_RDR             (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_RDR_OFFSET)
#define S32K3XX_LPSPI2_RDROR           (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_RDROR_OFFSET)
#define S32K3XX_LPSPI2_TCBR            (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_TCBR_OFFSET)
#define S32K3XX_LPSPI2_TDBR(n)         (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_TDBR_OFFSET(n))
#define S32K3XX_LPSPI2_RDBR(n)         (S32K3XX_LPSPI2_BASE + S32K3XX_LPSPI_RDBR_OFFSET(n))

#define S32K3XX_LPSPI3_VERID           (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_VERID_OFFSET)
#define S32K3XX_LPSPI3_PARAM           (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_PARAM_OFFSET)
#define S32K3XX_LPSPI3_CR              (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_CR_OFFSET)
#define S32K3XX_LPSPI3_SR              (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_SR_OFFSET)
#define S32K3XX_LPSPI3_IER             (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_IER_OFFSET)
#define S32K3XX_LPSPI3_DER             (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_DER_OFFSET)
#define S32K3XX_LPSPI3_CFGR0           (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_CFGR0_OFFSET)
#define S32K3XX_LPSPI3_CFGR1           (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_CFGR1_OFFSET)
#define S32K3XX_LPSPI3_DMR0            (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_DMR0_OFFSET)
#define S32K3XX_LPSPI3_DMR1            (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_DMR1_OFFSET)
#define S32K3XX_LPSPI3_CCR             (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_CCR_OFFSET)
#define S32K3XX_LPSPI3_CCR1            (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_CCR1_OFFSET)
#define S32K3XX_LPSPI3_FCR             (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_FCR_OFFSET)
#define S32K3XX_LPSPI3_FSR             (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_FSR_OFFSET)
#define S32K3XX_LPSPI3_TCR             (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_TCR_OFFSET)
#define S32K3XX_LPSPI3_TDR             (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_TDR_OFFSET)
#define S32K3XX_LPSPI3_RSR             (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_RSR_OFFSET)
#define S32K3XX_LPSPI3_RDR             (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_RDR_OFFSET)
#define S32K3XX_LPSPI3_RDROR           (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_RDROR_OFFSET)
#define S32K3XX_LPSPI3_TCBR            (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_TCBR_OFFSET)
#define S32K3XX_LPSPI3_TDBR(n)         (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_TDBR_OFFSET(n))
#define S32K3XX_LPSPI3_RDBR(n)         (S32K3XX_LPSPI3_BASE + S32K3XX_LPSPI_RDBR_OFFSET(n))

#define S32K3XX_LPSPI4_VERID           (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_VERID_OFFSET)
#define S32K3XX_LPSPI4_PARAM           (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_PARAM_OFFSET)
#define S32K3XX_LPSPI4_CR              (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_CR_OFFSET)
#define S32K3XX_LPSPI4_SR              (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_SR_OFFSET)
#define S32K3XX_LPSPI4_IER             (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_IER_OFFSET)
#define S32K3XX_LPSPI4_DER             (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_DER_OFFSET)
#define S32K3XX_LPSPI4_CFGR0           (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_CFGR0_OFFSET)
#define S32K3XX_LPSPI4_CFGR1           (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_CFGR1_OFFSET)
#define S32K3XX_LPSPI4_DMR0            (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_DMR0_OFFSET)
#define S32K3XX_LPSPI4_DMR1            (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_DMR1_OFFSET)
#define S32K3XX_LPSPI4_CCR             (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_CCR_OFFSET)
#define S32K3XX_LPSPI4_CCR1            (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_CCR1_OFFSET)
#define S32K3XX_LPSPI4_FCR             (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_FCR_OFFSET)
#define S32K3XX_LPSPI4_FSR             (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_FSR_OFFSET)
#define S32K3XX_LPSPI4_TCR             (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_TCR_OFFSET)
#define S32K3XX_LPSPI4_TDR             (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_TDR_OFFSET)
#define S32K3XX_LPSPI4_RSR             (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_RSR_OFFSET)
#define S32K3XX_LPSPI4_RDR             (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_RDR_OFFSET)
#define S32K3XX_LPSPI4_RDROR           (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_RDROR_OFFSET)
#define S32K3XX_LPSPI4_TCBR            (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_TCBR_OFFSET)
#define S32K3XX_LPSPI4_TDBR(n)         (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_TDBR_OFFSET(n))
#define S32K3XX_LPSPI4_RDBR(n)         (S32K3XX_LPSPI4_BASE + S32K3XX_LPSPI_RDBR_OFFSET(n))

