apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_lpspi.h
#define S32K3XX_LPSPI5_VERID           (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_VERID_OFFSET)
#define S32K3XX_LPSPI5_PARAM           (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_PARAM_OFFSET)
#define S32K3XX_LPSPI5_CR              (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_CR_OFFSET)
#define S32K3XX_LPSPI5_SR              (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_SR_OFFSET)
#define S32K3XX_LPSPI5_IER             (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_IER_OFFSET)
#define S32K3XX_LPSPI5_DER             (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_DER_OFFSET)
#define S32K3XX_LPSPI5_CFGR0           (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_CFGR0_OFFSET)
#define S32K3XX_LPSPI5_CFGR1           (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_CFGR1_OFFSET)
#define S32K3XX_LPSPI5_DMR0            (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_DMR0_OFFSET)
#define S32K3XX_LPSPI5_DMR1            (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_DMR1_OFFSET)
#define S32K3XX_LPSPI5_CCR             (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_CCR_OFFSET)
#define S32K3XX_LPSPI5_CCR1            (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_CCR1_OFFSET)
#define S32K3XX_LPSPI5_FCR             (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_FCR_OFFSET)
#define S32K3XX_LPSPI5_FSR             (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_FSR_OFFSET)
#define S32K3XX_LPSPI5_TCR             (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_TCR_OFFSET)
#define S32K3XX_LPSPI5_TDR             (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_TDR_OFFSET)
#define S32K3XX_LPSPI5_RSR             (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_RSR_OFFSET)
#define S32K3XX_LPSPI5_RDR             (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_RDR_OFFSET)
#define S32K3XX_LPSPI5_RDROR           (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_RDROR_OFFSET)
#define S32K3XX_LPSPI5_TCBR            (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_TCBR_OFFSET)
#define S32K3XX_LPSPI5_TDBR(n)         (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_TDBR_OFFSET(n))
#define S32K3XX_LPSPI5_RDBR(n)         (S32K3XX_LPSPI5_BASE + S32K3XX_LPSPI_RDBR_OFFSET(n))

/* LPSPI Register Bitfield Definitions **************************************/

/* Version ID Register (VERID)  */

#define LPSPI_VERID_FEATURE_SHIFT      (0)       /* Bits 0-15: Module Identification Number (FEATURE) */
#define LPSPI_VERID_FEATURE_MASK       (0xffff << LPSPI_VERID_FEATURE_SHIFT)
#define LPSPI_VERID_MINOR_SHIFT        (16)      /* Bits 16-23: Minor Version Number (MINOR) */
#define LPSPI_VERID_MINOR_MASK         (0xff << LPSPI_VERID_MINOR_SHIFT)
#define LPSPI_VERID_MAJOR_SHIFT        (24)      /* Bits 24-31: Major Version Number (MAJOR) */
#define LPSPI_VERID_MAJOR_MASK         (0xff << LPSPI_VERID_MAJOR_SHIFT)

/* Parameter Register (PARAM) */

#define LPSPI_PARAM_TXFIFO_SHIFT       (0)       /* Bits 0-7: Transmit FIFO Size (TXFIFO) */
#define LPSPI_PARAM_TXFIFO_MASK        (0xff << LPSPI_PARAM_TXFIFO_SHIFT)
#define LPSPI_PARAM_RXFIFO_SHIFT       (8)       /* Bits 8-15: Receive FIFO Size (RXFIFO) */
#define LPSPI_PARAM_RXFIFO_MASK        (0xff << LPSPI_PARAM_RXFIFO_SHIFT)
#define LPSPI_PARAM_PCSNUM_SHIFT       (16)      /* Bits 16-23: PCS Number (PCSNUM) */
#define LPSPI_PARAM_PCSNUM_MASK        (0xff << LPSPI_PARAM_PCSNUM_SHIFT)
                                                 /* Bits 24-31: Reserved */

/* Control Register (CR) */

#define LPSPI_CR_MEN                   (1 << 0)  /* Bit 0: Module Enable (MEN) */
#define LPSPI_CR_RST                   (1 << 1)  /* Bit 1: Software Reset (RST) */
                                                 /* Bit 2: Reserved */
#define LPSPI_CR_DBGEN                 (1 << 3)  /* Bit 3: Debug Enable (DBGEN) */
                                                 /* Bits 4-7: Reserved */
#define LPSPI_CR_RTF                   (1 << 8)  /* Bit 8: Reset Transmit FIFO (RTF) */
#define LPSPI_CR_RRF                   (1 << 9)  /* Bit 9: Reset Receive FIFO (RRF) */
                                                 /* Bits 10-31: Reserved */

/* Status Register (SR) */

#define LPSPI_SR_TDF                   (1 << 0)  /* Bit 0: Transmit Data Flag (TDF) */
#define LPSPI_SR_RDF                   (1 << 1)  /* Bit 1: Receive Data Flag (RDF) */
                                                 /* Bits 2-7: Reserved */
#define LPSPI_SR_WCF                   (1 << 8)  /* Bit 8: Word Complete Flag (WCF) */
#define LPSPI_SR_FCF                   (1 << 9)  /* Bit 9: Frame Complete Flag (FCF) */
#define LPSPI_SR_TCF                   (1 << 10) /* Bit 10: Transfer Complete Flag (TCF) */
#define LPSPI_SR_TEF                   (1 << 11) /* Bit 11: Transmit Error Flag (TEF) */
#define LPSPI_SR_REF                   (1 << 12) /* Bit 12: Receive Error Flag (REF) */
#define LPSPI_SR_DMF                   (1 << 13) /* Bit 13: Data Match Flag (DMF) */
                                                 /* Bits 14-23: Reserved */
#define LPSPI_SR_MBF                   (1 << 24) /* Bit 24: Module Busy Flag (MBF) */
                                                 /* Bits 25-31: Reserved */

/* Interrupt Enable Register (IER) */

#define LPSPI_IER_TDIE                 (1 << 0)  /* Bit 0: Transmit Data Interrupt Enable (TDIE) */
#define LPSPI_IER_RDIE                 (1 << 1)  /* Bit 1: Receive Data Interrupt Enable (RDIE) */
                                                 /* Bits 2-7: Reserved */
#define LPSPI_IER_WCIE                 (1 << 8)  /* Bit 8: Word Complete Interrupt Enable (WCIE) */
#define LPSPI_IER_FCIE                 (1 << 9)  /* Bit 9: Frame Complete Interrupt Enable (FCIE) */
#define LPSPI_IER_TCIE                 (1 << 10) /* Bit 10: Transfer Complete Interrupt Enable (TCIE) */
#define LPSPI_IER_TEIE                 (1 << 11) /* Bit 11: Transmit Error Interrupt Enable (TEIE) */
#define LPSPI_IER_REIE                 (1 << 12) /* Bit 12: Receive Error Interrupt Enable (REIE) */
#define LPSPI_IER_DMIE                 (1 << 13) /* Bit 13: Data Match Interrupt Enable (DMIE) */
                                                 /* Bits 14-31: Reserved */

/* DMA Enable Register (DER) */

#define LPSPI_DER_TDDE                 (1 << 0)  /* Bit 0: Transmit Data DMA Enable (TDDE) */
#define LPSPI_DER_RDDE                 (1 << 1)  /* Bit 1: Receive Data DMA Enable (RDDE) */
                                                 /* Bits 2-31: Reserved */

/* Configuration Register 0 (CFGR0) */

