apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_lpspi.h
#define LPSPI_CFGR0_HREN               (1 << 0)  /* Bit 0: Host Request Enable (HREN) */
#define LPSPI_CFGR0_HRPOL              (1 << 1)  /* Bit 1: Host Request Polarity (HRPOL) */
#  define LPSPI_CFGR0_HRPOL_HIGH       (0 << 1)  /*        HREQ pin or input trigger is active high */
#  define LPSPI_CFGR0_HRPOL_LOW        (1 << 1)  /*        HREQ pin or input trigger is active low */
#define LPSPI_CFGR0_HRSEL              (1 << 2)  /* Bit 2: Host Request Select (HRSEL) */
#  define LPSPI_CFGR0_HRSEL_HREQ       (0 << 2)  /*        Host request input is the LPSPI_HREQ pin */
#  define LPSPI_CFGR0_HRSEL_INTR       (1 << 2)  /*        Host request input is the input trigger */
#define LPSPI_CFGR0_HRDIR              (1 << 3)  /* Bit 3: Host Request Direction (HRDIR) */
#  define LPSPI_CFGR0_HRDIR_INPUT      (0 << 3)  /*        HREQ pin is configured as input */
#  define LPSPI_CFGR0_HRDIR_OUTPUT     (1 << 3)  /*        HREQ pin is configured as output */
                                                 /* Bits 4-7: Reserved */
#define LPSPI_CFGR0_CIRFIFO            (1 << 8)  /* Bit 8: Circular FIFO Enable (CIRCFIFO) */
#define LPSPI_CFGR0_RDMO               (1 << 9)  /* Bit 9: Receive Data Match Only (RDMO) */
#  define LPSPI_CFGR0_RDMO_FIFO        (0 << 9)  /*        Received data is stored in the receive FIFO as in normal operations */
#  define LPSPI_CFGR0_RDMO_DMF         (1 << 9)  /*        Received data is discarded unless the Data Match Flag (DMF) is set */
                                                 /* Bits 10-31: Reserved */

/* Configuration Register 1 (CFGR1) */

#define LPSPI_CFGR1_MASTER             (1 << 0)  /* Bit 0: Master Mode (MASTER) */
#define LPSPI_CFGR1_SAMPLE             (1 << 1)  /* Bit 1: Sample Point (SAMPLE) */
#  define LPSPI_CFGR1_SAMPLE_SCK       (0 << 1)  /*        Input data is sampled on SCK edge */
#  define LPSPI_CFGR1_SAMPLE_DELAY     (1 << 1)  /*        Input data is sampled on delayed SCK edge */
#define LPSPI_CFGR1_AUTOPCS            (1 << 2)  /* Bit 2: Automatic PCS (AUTOPCS) */
#define LPSPI_CFGR1_NOSTALL            (1 << 3)  /* Bit 3: No Stall (NOSTALL) */
#define LPSPI_CFGR1_PARTIAL            (1 << 4)  /* Bit 4: Partial Enable (PARTIAL) */
                                                 /* Bits 5-7: Reserved */
#define LPSPI_CFGR1_PCSPOL_SHIFT       (8)       /* Bits 8-15: Peripheral Chip Select Polarity (PCSPOL) */
#define LPSPI_CFGR1_PCSPOL_MASK        (0xff << LPSPI_CFGR1_PCSPOL_SHIFT)
#  define LPSPI_CFGR1_PCSPOL_LOW(n)    (0 << (LPSPI_CFGR1_PCSPOL_SHIFT + (n))) /* The Peripheral Chip Select PCS[n] pin is active low */
#  define LPSPI_CFGR1_PCSPOL_HIGH(n)   (1 << (LPSPI_CFGR1_PCSPOL_SHIFT + (n))) /* The Peripheral Chip Select PCS[n] pin is active high */

#define LPSPI_CFGR1_MATCFG_SHIFT       (16)      /* Bits 16-18: Match Configuration (MATCFG) */
#define LPSPI_CFGR1_MATCFG_MASK        (0x07 << LPSPI_CFGR1_MATCFG_SHIFT)
#define LPSPI_CFGR1_MATCFG_DIS         (0x00 << LPSPI_CFGR1_MATCFG_SHIFT)  /* Match is disabled */

                                                 /* Bits 19-23: Reserved */
#define LPSPI_CFGR1_PINCFG_SHIFT       (24)      /* Bits 24-25: Pin Configuration (PINCFG) */
#define LPSPI_CFGR1_PINCFG_MASK        (0x03 << LPSPI_CFGR1_PINCFG_SHIFT)
#  define LPSPI_CFGR1_PINCFG_SIN_SOUT  (0x00 << LPSPI_CFGR1_PINCFG_SHIFT) /* SIN is used for input data and SOUT is used for output data */
#  define LPSPI_CFGR1_PINCFG_SIN_SIN   (0x01 << LPSPI_CFGR1_PINCFG_SHIFT) /* SIN is used for both input and output data */
#  define LPSPI_CFGR1_PINCFG_SOUT_SOUT (0x02 << LPSPI_CFGR1_PINCFG_SHIFT) /* SOUT is used for both input and output data */
#  define LPSPI_CFGR1_PINCFG_SOUT_SIN  (0x03 << LPSPI_CFGR1_PINCFG_SHIFT) /* SOUT is used for input data and SIN is used for output data */
#  define LPSPI_CFGR1_PINCFG(n)        ((n) << LPSPI_CFGR1_PINCFG_SHIFT)

#define LPSPI_CFGR1_OUTCFG             (1 << 26) /* Bit 26: Output Config (OUTCFG) */
#  define LPSPI_CFGR1_OUTCFG_RETAIN    (0 << 26) /*         Output data retains last value when chip select is negated */
#  define LPSPI_CFGR1_OUTCFG_TRISTATE  (1 << 26) /*         Output data is tristated when chip select is negated */
#define LPSPI_CFGR1_PCSCFG_SHIFT       (27)      /* Bits 27-28: Peripheral Chip Select Configuration (PCSCFG) */
#define LPSPI_CFGR1_PCSCFG_MASK        (0x03 << LPSPI_CFGR1_PCSCFG_SHIFT)
#  define LPSPI_CFGR1_PCSCFG_PCS       (0x00 << LPSPI_CFGR1_PCSCFG_SHIFT) /* PCS[2:7] are configured for chip select function */
#  define LPSPI_CFGR1_PCSCFG_4BIT      (0x01 << LPSPI_CFGR1_PCSCFG_SHIFT) /* PCS[2:3] are configured for half-duplex 4-bit transfers */
#  define LPSPI_CFGR1_PCSCFG_8BIT      (0x03 << LPSPI_CFGR1_PCSCFG_SHIFT) /* PCS[2:7] are configured for half-duplex 4-bit and 8-bit transfers */

                                                 /* Bits 29-31: Reserved */

/* Data Match Register 0 (DMR0) */

#define LPSPI_DMR0_MATCH0_SHIFT        (0)       /* Bits 0-31: Match 0 Value (MATCH0) */
#define LPSPI_DMR0_MATCH0_MASK         (0xffffffff << LPSPI_DMR0_MATCH0_SHIFT)

/* Data Match Register 0 (DMR1) */

#define LPSPI_DMR1_MATCH1_SHIFT        (0)       /* Bits 0-31: Match 1 Value (MATCH1) */
#define LPSPI_DMR1_MATCH1_MASK         (0xffffffff << LPSPI_DMR1_MATCH1_SHIFT)

/* Clock Configuration Register (CCR) */

#define LPSPI_CCR_SCKDIV_SHIFT         (0)       /* Bits 0-7: SCK Divider (SCKDIV) */
#define LPSPI_CCR_SCKDIV_MASK          (0xff << LPSPI_CCR_SCKDIV_SHIFT)
#    define LPSPI_CCR_SCKDIV(n)        (((uint32_t)(n) << LPSPI_CCR_SCKDIV_SHIFT) & LPSPI_CCR_SCKDIV_MASK)
#define LPSPI_CCR_DBT_SHIFT            (8)       /* Bits 8-15: Delay Between Transfers (DBT) */
#define LPSPI_CCR_DBT_MASK             (0xff << LPSPI_CCR_DBT_SHIFT)
#    define LPSPI_CCR_DBT(n)           (((uint32_t)(n) << LPSPI_CCR_DBT_SHIFT) & LPSPI_CCR_DBT_MASK)
#define LPSPI_CCR_PCSSCK_SHIFT         (16)      /* Bits 16-23: PCS-to-SCK Delay (PCSSCK) */
#define LPSPI_CCR_PCSSCK_MASK          (0xff << LPSPI_CCR_PCSSCK_SHIFT)
#    define LPSPI_CCR_PCSSCK(n)        (((uint32_t)(n) << LPSPI_CCR_PCSSCK_SHIFT) & LPSPI_CCR_PCSSCK_MASK)
#define LPSPI_CCR_SCKPCS_SHIFT         (24)      /* Bits 24-31: SCK-to-PCS Delay (SCKPCS) */
#define LPSPI_CCR_SCKPCS_MASK          (0xff << LPSPI_CCR_SCKPCS_SHIFT)
#    define LPSPI_CCR_SCKPCS(n)        (((uint32_t)(n) << LPSPI_CCR_SCKPCS_SHIFT) & LPSPI_CCR_SCKPCS_MASK)

