apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_lpspi.h
/* Clock Configuration Register 1 (CCR1) */

#define LPSPI_CCR1_SCKSET_SHIFT        (0)       /* Bits 0-7: SCK Setup (SCKSET) */
#define LPSPI_CCR1_SCKSET_MASK         (0xff << LPSPI_CCR1_SCKSET_SHIFT)
#define LPSPI_CCR1_SCKHLD_SHIFT        (8)       /* Bits 8-15: SCK Hold (SCKHLD) */
#define LPSPI_CCR1_SCKHLD_MASK         (0xff << LPSPI_CCR1_SCKHLD_SHIFT)
#define LPSPI_CCR1_PCSPCS_SHIFT        (16)      /* Bits 16-23: PCS to PCS Delay (PCSPCS) */
#define LPSPI_CCR1_PCSPCS_MASK         (0xff << LPSPI_CCR1_PCSPCS_SHIFT)
#define LPSPI_CCR1_SCKSCK_SHIFT        (24)      /* Bits 24-31: SCK Inter-Frame Delay (SCKSCK) */
#define LPSPI_CCR1_SCKSCK_MASK         (0xff << LPSPI_CCR1_SCKSCK_SHIFT)

/* FIFO Control Register (FCR) */

#define LPSPI_FCR_TXWATER_SHIFT        (0)       /* Bits 0-1: Transmit FIFO Watermark (TXWATER) */
#define LPSPI_FCR_TXWATER_MASK         (0x03 << LPSPI_FCR_TXWATER_SHIFT)
#    define LPSPI_FCR_TXWATER(n)       ((uint32_t)(n) << LPSPI_FCR_TXWATER_SHIFT)
                                                 /* Bits 2-15: Reserved */
#define LPSPI_FCR_RXWATER_SHIFT        (16)      /* Bits 16-17: Receive FIFO Watermark (RXWATER) */
#define LPSPI_FCR_RXWATER_MASK         (0x03 << LPSPI_FCR_RXWATER_SHIFT)
#    define LPSPI_FCR_RXWATER(n)       ((uint32_t)(n) << LPSPI_FCR_RXWATER_SHIFT)
                                                 /* Bits 18-31: Reserved */

/* FIFO Status Register (FSR) */

#define LPSPI_FSR_TXCOUNT_SHIFT        (0)       /* Bits 0-2: Transmit FIFO Count (TXCOUNT) */
#define LPSPI_FSR_TXCOUNT_MASK         (0x07 << LPSPI_FSR_TXCOUNT_SHIFT)
                                                 /* Bits 3-15: Reserved */
#define LPSPI_FSR_RXCOUNT_SHIFT        (16)      /* Bits 16-18: Receive FIFO Count (RXCOUNT) */
#define LPSPI_FSR_RXCOUNT_MASK         (0x07 << LPSPI_FSR_RXCOUNT_SHIFT)
                                                 /* Bits 19-31: Reserved */

/* Transmit Command Register (TCR) */

#define LPSPI_TCR_FRAMESZ_SHIFT        (0)       /* Bits 0-11: Frame Size (FRAMESZ) */
#define LPSPI_TCR_FRAMESZ_MASK         (0x0fff << LPSPI_TCR_FRAMESZ_SHIFT)
#    define LPSPI_TCR_FRAMESZ(n)       ((uint32_t)(n) << LPSPI_TCR_FRAMESZ_SHIFT)
                                                 /* Bits 12-15: Reserved */
#define LPSPI_TCR_WIDTH_SHIFT          (16)      /* Bits 16-17: Transfer Width (WIDTH) */
#define LPSPI_TCR_WIDTH_MASK           (0x03 << LPSPI_TCR_WIDTH_SHIFT)
#  define LPSPI_TCR_WIDTH_1BIT         (0x00 << LPSPI_TCR_WIDTH_SHIFT) /* 1 bit transfer */
#  define LPSPI_TCR_WIDTH_2BIT         (0x01 << LPSPI_TCR_WIDTH_SHIFT) /* 2 bit transfer */
#  define LPSPI_TCR_WIDTH_4BIT         (0x02 << LPSPI_TCR_WIDTH_SHIFT) /* 4 bit transfer */
#  define LPSPI_TCR_WIDTH_8BIT         (0x03 << LPSPI_TCR_WIDTH_SHIFT) /* 8 bit transfer */

#define LPSPI_TCR_TXMSK                (1 << 18) /* Bit 18: Transmit Data Mask (TXMSK) */
#define LPSPI_TCR_RXMSK                (1 << 19) /* Bit 19: Receive Data Mask (RXMSK) */
#define LPSPI_TCR_CONTC                (1 << 20) /* Bit 20: Continuing Command (CONTC) */
#define LPSPI_TCR_CONT                 (1 << 21) /* Bit 21: Continuous Transfer (CONT) */
#define LPSPI_TCR_BYSW                 (1 << 22) /* Bit 22: Byte Swap (BYSW) */
#define LPSPI_TCR_LSBF                 (1 << 23) /* Bit 23: LSB First (LSBF) */
#  define LPSPI_TCR_MSBF               (0 << 23) /*         MSB First */
#define LPSPI_TCR_PCS_SHIFT            (24)      /* Bits 24-26: Peripheral Chip Select (PCS) */
#define LPSPI_TCR_PCS_MASK             (0x07 << LPSPI_TCR_PCS_SHIFT)
#  define LPSPI_TCR_PCS_0              (0x00 << LPSPI_TCR_PCS_SHIFT) /* Transfer using PCS[0] */
#  define LPSPI_TCR_PCS_1              (0x01 << LPSPI_TCR_PCS_SHIFT) /* Transfer using PCS[1] */
#  define LPSPI_TCR_PCS_2              (0x02 << LPSPI_TCR_PCS_SHIFT) /* Transfer using PCS[2] */
#  define LPSPI_TCR_PCS_3              (0x03 << LPSPI_TCR_PCS_SHIFT) /* Transfer using PCS[3] */
#  define LPSPI_TCR_PCS_4              (0x04 << LPSPI_TCR_PCS_SHIFT) /* Transfer using PCS[4] */
#  define LPSPI_TCR_PCS_5              (0x05 << LPSPI_TCR_PCS_SHIFT) /* Transfer using PCS[5] */
#  define LPSPI_TCR_PCS_6              (0x06 << LPSPI_TCR_PCS_SHIFT) /* Transfer using PCS[6] */
#  define LPSPI_TCR_PCS_7              (0x07 << LPSPI_TCR_PCS_SHIFT) /* Transfer using PCS[7] */

#define LPSPI_TCR_PRESCALE_SHIFT       (27)      /* Bits 27-29: Prescaler Value (PRESCALE) */
#define LPSPI_TCR_PRESCALE_MASK        (0x07 << LPSPI_TCR_PRESCALE_SHIFT)
#  define LPSPI_TCR_PRESCALE_DIV1      (0x00 << LPSPI_TCR_PRESCALE_SHIFT) /* Divide by 1 */
#  define LPSPI_TCR_PRESCALE_DIV2      (0x01 << LPSPI_TCR_PRESCALE_SHIFT) /* Divide by 2 */
#  define LPSPI_TCR_PRESCALE_DIV4      (0x02 << LPSPI_TCR_PRESCALE_SHIFT) /* Divide by 4 */
#  define LPSPI_TCR_PRESCALE_DIV8      (0x03 << LPSPI_TCR_PRESCALE_SHIFT) /* Divide by 8 */
#  define LPSPI_TCR_PRESCALE_DIV16     (0x04 << LPSPI_TCR_PRESCALE_SHIFT) /* Divide by 16 */
#  define LPSPI_TCR_PRESCALE_DIV32     (0x05 << LPSPI_TCR_PRESCALE_SHIFT) /* Divide by 32 */
#  define LPSPI_TCR_PRESCALE_DIV64     (0x06 << LPSPI_TCR_PRESCALE_SHIFT) /* Divide by 64 */
#  define LPSPI_TCR_PRESCALE_DIV128    (0x07 << LPSPI_TCR_PRESCALE_SHIFT) /* Divide by 128 */
#  define LPSPI_TCR_PRESCALE(n)        ((n) << LPSPI_TCR_PRESCALE_SHIFT)

#define LPSPI_TCR_CPHA                 (1 << 30) /* Bit 30: Clock Phase (CPHA) */
#  define LPSPI_TCR_CPHA_CAPTURED      (0 << 30) /*         Data is captured on the leading edge of SCK and changed on the following edge of SCK */
#  define LPSPI_TCR_CPHA_CHANGED       (1 << 30) /*         Data is changed on the leading edge of SCK and captured on the following edge of SCK */
#define LPSPI_TCR_CPOL                 (1 << 31) /* Bit 31: Clock Polarity (CPOL) */
#  define LPSPI_TCR_CPOL_LOW           (0 << 31) /*         The inactive state value of SCK is low */
#  define LPSPI_TCR_CPOL_HIGH          (1 << 31) /*         The inactive state value of SCK is high */

/* Transmit Data Register (TDR) */

#define LPSPI_TDR_DATA_SHIFT           (0)       /* Bits 0-31: Transmit Data (DATA) */
#define LPSPI_TDR_DATA_MASK            (0xffffffff << LPSPI_TDR_DATA_SHIFT)

/* Receive Status Register (RSR) */

#define LPSPI_RSR_SOF                  (1 << 0)  /* Bit 0: Start Of Frame (SOF) */
#define LPSPI_RSR_RXEMPTY              (1 << 1)  /* Bit 1: RX FIFO Empty (RXEMPTY) */
                                                 /* Bits 2-31: Reserved */

/* Receive Data Register (RDR) */

#define LPSPI_RDR_DATA_SHIFT           (0)       /* Bits 0-31: Receive Data (DATA) */
#define LPSPI_RDR_DATA_MASK            (0xffffffff << LPSPI_RDR_DATA_SHIFT)

/* Receive Data Read Only Register (RDROR) */

#define LPSPI_RDROR_DATA_SHIFT         (0)       /* Bits 0-31: Receive Data (DATA) */
#define LPSPI_RDROR_DATA_MASK          (0xffffffff << LPSPI_RDROR_DATA_SHIFT)

/* Transmit Command Burst Register (TCBR) */

#define LPSPI_TCBR_DATA_SHIFT          (0)       /* Bits 0-31: Command Data (DATA) */
#define LPSPI_TCBR_DATA_MASK           (0xffffffff << LPSPI_TCBR_DATA_SHIFT)

/* Transmit Data Burst Register (TDBR) */

#define LPSPI_TDBR_DATA_SHIFT          (0)       /* Bits 0-31: Data (DATA) */
#define LPSPI_TDBR_DATA_MASK           (0xffffffff << LPSPI_TDBR_DATA_SHIFT)

/* Receive Data Burst Register (RDBR) */

#define LPSPI_RDBR_DATA_SHIFT          (0)       /* Bits 0-31: Data (DATA) */
#define LPSPI_RDBR_DATA_MASK           (0xffffffff << LPSPI_RDBR_DATA_SHIFT)

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_LPSPI_H */
